app/controllers/firsts_controller.rb

  def index
    @firsts = First.all
---
SELECT "firsts".* FROM "firsts"

  def show
    @first = First.find(params[:id])
---
SELECT "firsts".* FROM "firsts" WHERE "firsts"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @first = First.find(params[:id])
---
SELECT "firsts".* FROM "firsts" WHERE "firsts"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @first = First.new(params[:first])

    respond_to do |format|
      if @first.save
---
INSERT INTO "firsts" ("contact", "created_at", "emailid", "last", "name", "number", "password", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @first = First.find(params[:id])
    @first.destroy
---
SELECT "firsts".* FROM "firsts" WHERE "firsts"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "firsts" WHERE "firsts"."id" = ?  [["id", 1]]